##  Laboratoria 1 - zadanie 4 
*Wykonał: Radosław Szpot*   
Ćwiczenie przedstawiające wykorzystanie biblioteki pandas w celu stworzenia obiektu przechowującego dane.

Import bibliotek oraz utworzenie obiektu z pięcioma przykładowymi rekordami:

In [42]:
import pandas as pd
import numpy as np
data_ex = pd.DataFrame(np.array([["Krzesimir", "Waza", "20", "male"],
                              ["George ", "Washington", "289", "male"],
                              ["Ann ", "Li", "21", "female"],
                              ["Sarah", "Jones", "38", "female"],
                              ["Elon ", "Muscle", "16", "male"]]),
                    columns=['name', 'surname', 'age', 'sex'])

Wypisanie w konsoli utworzonego zbioru rekordów:

In [43]:
data_ex

        name     surname  age     sex
0  Krzesimir        Waza   20    male
1    George   Washington  289    male
2       Ann           Li   21  female
3      Sarah       Jones   38  female
4      Elon       Muscle   16    male

Informacje o danych uzyskuje się za pomocą metody info()

In [44]:
data_ex.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     5 non-null      object
 1   surname  5 non-null      object
 2   age      5 non-null      object
 3   sex      5 non-null      object
dtypes: object(4)
memory usage: 288.0+ bytes

Opis danych uzyskuje się za pomocą metody describe()

In [45]:
data_ex.describe()

         name surname age   sex
count       5       5   5     5
unique      5       5   5     2
top     Elon       Li  21  male
freq        1       1   1     3

Wyświetlanie pierwszych 3 rekordów za pomocą metody head()

In [46]:
data_ex.head(3)

        name     surname  age     sex
0  Krzesimir        Waza   20    male
1    George   Washington  289    male
2       Ann           Li   21  female